---
kind: method
id: M:Autodesk.Revit.DB.SymbolicCurveArrayIterator.#ctor
source: html/4f104ba6-dce3-a6b6-b8fe-9d20641c809f.htm
---
# Autodesk.Revit.DB.SymbolicCurveArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public SymbolicCurveArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.